insert into langxin_community.residents_accumulative (`街道`,`社区`,`网格`,`小区`, `所居住花园小区/城中村名称`,`所属电子哨兵卡口名称`,`姓名`,`性别`,`人员类型`,`证件类型`,`证件号码`,
 `出生年月`,`手机号码`,`国籍`,`是否暂离`,`户籍地址`,`工作单位所在市`,`工作单位所在行政区`,`工作单位名称`,`工作单位地址`,
 `是否纳入市网格办统计`,`楼栋地址`,`楼栋编码`,`房屋地址`,`房屋编码`,`备注`,`审核结果`,`审核人`,`审核时间`,`上报类型`,`是否在灰名单`, `灰名单类型`, `灰名单原因`, `上次核酸检测时间`, `加入白名单时间`)
select nra.`街道`,nra.`社区`,nra.`网格`, nra.`小区`, nra.`所居住花园小区/城中村名称`,nra.`所属电子哨兵卡口名称`,nra.`姓名`,nra.`性别`,nra.`人员类型`,
       nra.`证件类型`,nra.`证件号码`,nra.`出生年月`,nra.`手机号码`,nra.`国籍`,nra.`是否暂离`,nra.`户籍地址`,nra.`工作单位所在市`,
       nra.`工作单位所在行政区`,nra.`工作单位名称`,nra.`工作单位地址`,nra.`是否纳入市网格办统计`,nra.`楼栋地址`,nra.`楼栋编码`,nra.`房屋地址`,
       nra.`房屋编码`,nra.`备注`,nra.`审核结果`,nra.`审核人`,nra.`审核时间`,nra.`上报类型`, nra.`是否在灰名单`, nra.灰名单类型, nra.灰名单原因, nra.上次核酸检测时间, '{date}'
from
    langxin_community.new_residents_accumulative nra;


