residents_columns = ['id', '街道', '社区', '网格', '所居住花园小区/城中村名称', '所属电子哨兵卡口名称', '姓名', '性别', '人员类型', '证件类型', '证件号码', '出生年月',
                     '手机号码', '国籍', '是否暂离', '户籍地址', '工作单位所在市', '工作单位所在行政区', '工作单位名称', '工作单位地址', '是否纳入市网格办统计', '楼栋地址',
                     '楼栋编码', '房屋地址', '房屋编码', '备注', '审核结果', '审核人', '审核时间', '上报类型', '是否在白名单', '是否在黑名单', ]

covid_records_columns = ['id', '姓名', '出生日期', '年龄', '电话号码', '机构所在地', '采样机构', '采样时间', '检测机构',
                         '检测时间', '检测结果', '检测结果填报时间', '复核结果', '复核机构', '复核时间', '性别', '国家/地区', '居住地', '证件类型', '证件号码',
                         '未提供有效证件原因', '检测人群分类', '应检尽检类别', '导入机构', '样本条形码', '样本类型', '检测项目', '采样点行政区划', '采样地点',
                         '所在学校/单位名称', '备注1', '备注2', '采集类型', '导入时间', '创建人账号', '创建人姓名', ]
